Ran Plan for dir: `stage` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.ec2_instance.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ arn                                  = "arn:aws:ec2:ap-south-1:835518098452:instance/i-0eb9a5a532467d3e9" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "ap-south-1a" -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0eb9a5a532467d3e9" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = "actions-runner-key" # forces replacement
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0dacde8bb0447b4f8" -> (known after apply)
      ~ private_dns                          = "ip-192-168-5-186.ap-south-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "192.168.5.186" -> (known after apply)
      ~ public_dns                           = "ec2-13-234-17-145.ap-south-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "13.234.17.145" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ tags                                 = {
          ~ "Name" = "actions-runner-stage" -> "actions-runner-stage-2"
            "env"  = "stage"
            "team" = "devops"
        }
      ~ tags_all                             = {
          ~ "Name" = "actions-runner-stage" -> "actions-runner-stage-2"
            # (2 unchanged elements hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ volume_tags                          = {
          ~ "Name" = "actions-runner-stage" -> "actions-runner-stage-2"
            # (2 unchanged elements hidden)
        }
      ~ vpc_security_group_ids               = [
          - "sg-09dd9441dde5d0db0",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      ~ credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ network_interface (known after apply)

      ~ primary_network_interface (known after apply)
      - primary_network_interface {
          - delete_on_termination = true -> null
          - network_interface_id  = "eni-0dacde8bb0447b4f8" -> null
        }

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-04c11bb2de01f017e" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ec2_instance.aws_security_group.this[0] must be replaced
+/- resource "aws_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:ap-south-1:835518098452:security-group/sg-09dd9441dde5d0db0" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all IPv4 traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow all IPv6 traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-09dd9441dde5d0db0" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "actions-runner-stage-20250914173824039600000001" -> (known after apply)
      ~ name_prefix            = "actions-runner-stage-" -> "actions-runner-stage-2-" # forces replacement
      ~ owner_id               = "835518098452" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "actions-runner-stage" -> "actions-runner-stage-2"
            "env"  = "stage"
            "team" = "devops"
        }
      ~ tags_all               = {
          ~ "Name" = "actions-runner-stage" -> "actions-runner-stage-2"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv4_default"] must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "this" {
      ~ arn                    = "arn:aws:ec2:ap-south-1:835518098452:security-group-rule/sgr-0e25de026cc5dfbcf" -> (known after apply)
      ~ id                     = "sgr-0e25de026cc5dfbcf" -> (known after apply)
      ~ security_group_id      = "sg-09dd9441dde5d0db0" -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0e25de026cc5dfbcf" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "actions-runner-stage-ipv4_default" -> "actions-runner-stage-2-ipv4_default"
            "env"  = "stage"
            "team" = "devops"
        }
      ~ tags_all               = {
          ~ "Name" = "actions-runner-stage-ipv4_default" -> "actions-runner-stage-2-ipv4_default"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv6_default"] must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "this" {
      ~ arn                    = "arn:aws:ec2:ap-south-1:835518098452:security-group-rule/sgr-0fd660d8822c894ed" -> (known after apply)
      ~ id                     = "sgr-0fd660d8822c894ed" -> (known after apply)
      ~ security_group_id      = "sg-09dd9441dde5d0db0" -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0fd660d8822c894ed" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "actions-runner-stage-ipv6_default" -> "actions-runner-stage-2-ipv6_default"
            "env"  = "stage"
            "team" = "devops"
        }
      ~ tags_all               = {
          ~ "Name" = "actions-runner-stage-ipv6_default" -> "actions-runner-stage-2-ipv6_default"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.tf_state_bucket_s3_2025,
│   on main.tf line 21, in resource "aws_s3_bucket" "tf_state_bucket_s3_2025":
│   21: resource "aws_s3_bucket" "tf_state_bucket_s3_2025" {
│ 
│ versioning is deprecated. Use the aws_s3_bucket_versioning resource
│ instead.
│ 
│ (and one more similar warning elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=poptech-global-tech-pvt-ltd%252Fterraforming-pop-stage%252Fstage%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d stage
  ```
Plan: 4 to add, 0 to change, 4 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```